ЕУЫЕ

video_card
cpu
motherboard
cooling
ram
ssd
hdd
housing
power_supply


sql = f'INSERT INTO cpu VALUES (?, ?, ?)'
cursor.execute(sql, (
    "Название",
    цена,
    """
описание
    """
))
conn.commit()


cpu = [
[
	'Процессор AMD Ryzen 7 3700X OEM',
  	28989,
  	"""
Ядро:
Matisse
Гнездо процессора:
SocketAM4
Количество ядер:
8
Количество потоков:
16
Частота:
3.6 ГГц и 4.4 ГГц в режиме Turbo
L3 кэш:
32 МБ
Технологический процесс:
7 нм
Тип поставки:
OEM
Тип памяти:
DDR4
Количество каналов памяти:
2
Версия PCI Express:
PCI Express 4.0
  	"""
],
[
	'Процессор AMD Ryzen 5 3600',
  	16990,
  	"""
Ядро:
Matisse
Гнездо процессора:
SocketAM4
Количество ядер:
6
Количество потоков:
12
Частота:
3.6 ГГц и 4.2 ГГц в режиме Turbo
L3 кэш:
32 МБ
Технологический процесс:
7 нм
Тип поставки:
OEM
Тип памяти:
DDR4
Количество каналов памяти:
2
Версия PCI Express:
PCI Express 4.0
  	"""
],
[
	'Процессор AMD Ryzen 7 2700',
  	12390,
  	"""
Ядро
Pinnacle Ridge
Гнездо процессора
SocketAM4
Количество ядер
8
Количество потоков
16
Частота
3.2 ГГц и 4.1 ГГц в режиме Turbo
L3 кэш
16 МБ
Технологический процесс
12 нм
Тип поставки
OEM
Тип памяти
DDR4
Количество каналов памяти
2
Версия PCI Express
PCI Express 3.0
  	"""
],
[
	'Процессор INTEL Core i5 9400F',
  	11590,
  	"""
Ядро
Coffee Lake
Гнездо процессора
LGA 1151v2
Количество ядер
6
Количество потоков
6
Частота
2.9 ГГц и 4.1 ГГц в режиме Turbo
L3 кэш
9 МБ
Технологический процесс
14 нм
Тип поставки
OEM
Максимальный объем памяти
128 ГБ
Тип памяти
DDR4
Количество каналов памяти
2
Версия PCI Express
PCI Express 3.0
  	"""
],
[
	'Процессор AMD Ryzen 5 2600',
  	10790,
  	"""
Ядро
Pinnacle Ridge
Гнездо процессора
SocketAM4
Количество ядер
6
Количество потоков
12
Частота
3.4 ГГц и 3.9 ГГц в режиме Turbo
L3 кэш
16 МБ
Технологический процесс
12 нм
Тип поставки
OEM
Тип памяти
DDR4
Количество каналов памяти
2
Версия PCI Express
PCI Express 3.0
  	"""
],
]